Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: More detail about the configuration are available in the https://github.com/amqphub/quarkus-qpid-jms#configuration[Quarkus Qpid JMS] documentation.
ja_jp: 設定の詳細については、 link:https://github.com/amqphub/quarkus-qpid-jms#configuration[Quarkus Qpid JMS] のドキュメントを参照してください。

source: More details about Basic authentication in Quarkus can be found in the xref:security-basic-authentication-howto.adoc[Basic authentication guide].
ja_jp: QuarkusのBasic認証の詳細は、 xref:security-basic-authentication-howto.adoc[Basic認証ガイド] に記載されています。

source: More details about Mutiny can be found in xref:mutiny-primer.adoc[Mutiny - an intuitive reactive programming library].
ja_jp: Mutiny についての詳細は、 xref:mutiny-primer.adoc[Mutiny - 直感的なリアクティブプログラミングライブラリー] に記載されています。

source: More details about asynchronous transformation can be found in the https://smallrye.io/smallrye-mutiny/getting-started/transforming-items-async[Mutiny documentation].
ja_jp: 非同期変換の詳細については、 link:https://smallrye.io/smallrye-mutiny/getting-started/transforming-items-async[Mutinyのドキュメント]を参照してください。

source: More details about asynchronous transformation can be found in the https://smallrye.io/smallrye-mutiny/latest/tutorials/transforming-items-asynchronously/[Mutiny documentation].
ja_jp: 非同期変換の詳細については、 https://smallrye.io/smallrye-mutiny/latest/tutorials/transforming-items-asynchronously/[Mutinyのドキュメント] を参照してください。

source: More details about the AMQP Address model can be found in the https://activemq.apache.org/components/artemis/documentation/2.0.0/address-model.html[Artemis documentation].
ja_jp: AMQP アドレスモデルの詳細については、 https://activemq.apache.org/components/artemis/documentation/2.0.0/address-model.html[Artemis documentation] を参照してください。

source: More details about the AMQP Address model can be found in the https://activemq.apache.org/components/artemis/documentation/latest/address-model.html[ActiveMQ Artemis documentation].
ja_jp: AMQP アドレスモデルの詳細については、 https://activemq.apache.org/components/artemis/documentation/latest/address-model.html[ActiveMQ Artemis ドキュメント] を参照してください。

source: More details about the SmallRye Reactive Messaging configuration can be found in the https://smallrye.io/smallrye-reactive-messaging/latest/kafka/kafka/#using-the-kafka-connector[SmallRye Reactive Messaging - Kafka Connector Documentation].
ja_jp: SmallRye Reactive Messaging 設定に関する詳細は、 https://smallrye.io/smallrye-reactive-messaging/smallrye-reactive-messaging/3.1/kafka/kafka.html[SmallRye Reactive Messaging - Kafka Connector Documentation] を参照してください。

source: More details about the SmallRye Reactive Messaging configuration can be found in the https://smallrye.io/smallrye-reactive-messaging/smallrye-reactive-messaging/3.1/kafka/kafka.html[SmallRye Reactive Messaging - Kafka Connector Documentation].
ja_jp: SmallRye Reactive Messaging 設定に関する詳細は、 https://smallrye.io/smallrye-reactive-messaging/smallrye-reactive-messaging/3.1/kafka/kafka.html[SmallRye Reactive Messaging - Kafka Connector Documentation] を参照してください。

source: More details about the `Router` API can be found on https://vertx.io/docs/vertx-web/java/[the Vert.x Web documentation].
ja_jp: `Router` APIの詳細は、 link:https://vertx.io/docs/vertx-web/java/[Vert.x Webドキュメント] に記載されています。

source: More details about the infrastructure integration can be found on https://smallrye.io/smallrye-mutiny/guides/infrastructure.
ja_jp: インフラ統合の詳細については、 https://smallrye.io/smallrye-mutiny/guides/infrastructure を参照してください。

source: More details about the infrastructure integration can be found on https://smallrye.io/smallrye-mutiny/latest/guides/framework-integration/.
ja_jp: インフラ統合の詳細については、 https://smallrye.io/smallrye-mutiny/latest/guides/framework-integration/ を参照してください。

source: More details about the various APIs offered by the quarkus-redis extension are available in the <<apis>> section.
ja_jp: quarkus-redis エクステンションで提供されるさまざまな API の詳細については、<<apis>> セクションを参照してください。

source: More details about the various APIs offered by the quarkus-redis extension are available in the xref:apis[One extension, multiple APIs] section.
ja_jp: quarkus-redisエクステンションが提供するさまざまなAPIの詳細については、 xref:apis[1つのエクステンション、複数のAPI] のセクションを参照してください。

source: More details about this API can be found on: https://quarkus.io/blog/mutiny-vertx/.
ja_jp: このAPIの詳細については、 https://quarkus.io/blog/mutiny-vertx/ を参照してください。

source: More details about this configuration is available on the https://kafka.apache.org/documentation/#producerconfigs[Producer configuration] and https://kafka.apache.org/documentation/#consumerconfigs[Consumer configuration] section from the Kafka documentation. These properties are configured with the prefix `kafka`. An exhaustive list of configuration properties is available in xref:kafka.adoc#kafka-configuration[Kafka Reference Guide - Configuration].
ja_jp: この設定の詳細については、Kafka ドキュメントの https://kafka.apache.org/documentation/#producerconfigs[プロデューサー設定] and https://kafka.apache.org/documentation/#consumerconfigs[コンシューマー設定] セクションを参照してください。これらのプロパティーは、 `kafka` という接頭辞で設定されます。設定プロパティーの完全なリストは、xref:kafka.adoc#kafka-configuration[Kafka リファレンスガイド - 設定] にあります。

source: More details about this configuration is available on the https://pulsar.apache.org/docs/3.0.x/concepts-messaging/ section from the Pulsar documentation. These properties are configured with the prefix `pulsar`. An exhaustive list of configuration properties is available in xref:pulsar.adoc#configuration-reference[Pulsar Reference Guide - Configuration].
ja_jp: この設定の詳細は、Pulsar ドキュメントの https://pulsar.apache.org/docs/3.0.x/concepts-messaging/ セクションを参照してください。 これらのプロパティーは、プレフィックス `pulsar` を使用して設定されます。 設定プロパティーの完全なリストは、xref:pulsar.adoc#configuration-reference[Pulsar リファレンスガイド - 設定] を参照してください。

source: More details about transformation can be found in the https://smallrye.io/smallrye-mutiny/getting-started/transforming-items[Mutiny documentation].
ja_jp: 変換の詳細については、 link:https://smallrye.io/smallrye-mutiny/getting-started/transforming-items[Mutiny]のドキュメントを参照してください。

source: More details about transformation can be found in the https://smallrye.io/smallrye-mutiny/latest/tutorials/transforming-items/[Mutiny documentation].
ja_jp: 変換の詳細については、 https://smallrye.io/smallrye-mutiny/latest/tutorials/transforming-items/[Mutinyのドキュメント] を参照してください。

source: More details about using the `RoutingContext` is available in the https://vertx.io/docs/vertx-web/java/[Vert.x Web documentation].
ja_jp: `RoutingContext` の使用の詳細については、 https://vertx.io/docs/vertx-web/java/[Vert.x Web ドキュメント] を参照してください。

source: More details can be found in the https://docs.oracle.com/en/database/oracle/oracle-database/21/jjdbc/data-sources-and-URLs.html#GUID-AEA8E228-1B21-4111-AF4C-B1F33744CA08[official documentation].
ja_jp: 詳しくは、 link:https://docs.oracle.com/en/database/oracle/oracle-database/21/jjdbc/data-sources-and-URLs.html#GUID-AEA8E228-1B21-4111-AF4C-B1F33744CA08[公式ドキュメント] をご覧ください。

source: More details in the link:/guides/cli-tooling[dedicated CLI guide].
ja_jp: 詳細は link:/guides/cli-tooling[専用のCLIガイド]でご確認ください。

source: More details on the GraalVM native-image bundle are available in the link:https://www.graalvm.org/{graalvm-docs-version}/reference-manual/native-image/overview/Bundles[GraalVM documentation].
ja_jp: GraalVM ネイティブイメージバンドルの詳細は、 link:https://www.graalvm.org/{graalvm-docs-version}/reference-manual/native-image/overview/Bundles[GraalVM ドキュメント] を参照してください。

source: More examples
ja_jp: その他の例

source: More info about failure recovery can be found on https://smallrye.io/smallrye-mutiny/getting-started/handling-failures[the handling failure documentation] and https://smallrye.io/smallrye-mutiny/getting-started/retry[the retry documentation].
ja_jp: 失敗のリカバリーについての詳細は、 link:https://smallrye.io/smallrye-mutiny/getting-started/handling-failures[失敗の処理のドキュメント]および link:https://smallrye.io/smallrye-mutiny/getting-started/retry[リトライのドキュメント]を参照してください。

source: More info about failure recovery can be found on https://smallrye.io/smallrye-mutiny/latest/tutorials/handling-failures/[the handling failure documentation] and https://smallrye.io/smallrye-mutiny/latest/tutorials/retrying/[the retrying on failures documentation].
ja_jp: 失敗のリカバリーについての詳細は、 https://smallrye.io/smallrye-mutiny/latest/tutorials/handling-failures/[失敗の処理のドキュメント] および https://smallrye.io/smallrye-mutiny/latest/tutorials/retrying/[リトライのドキュメント] を参照してください。

source: More information
ja_jp: 詳細情報

source: More information about how to create the secret in https://kubernetes.io/docs/concepts/services-networking/ingress/#tls[here].
ja_jp: シークレットの作成方法の詳細については、https://kubernetes.io/docs/concepts/services-networking/ingress/#tls こちらを参照してください。

source: More information about permission checkers can be found on the JavaDoc of link:https://javadoc.io/doc/io.quarkus.security/quarkus-security/latest/io.quarkus.security.api/io/quarkus/security/PermissionChecker.html[`@PermissionChecker`].
ja_jp: パーミッションチェッカーの詳細については、link:https://javadoc.io/doc/io.quarkus.security/quarkus-security/latest/io.quarkus.security.api/io/quarkus/security/PermissionChecker.html[`@PermissionChecker`] の JavaDoc を参照してください。

source: More information about reflection in GraalVM can be found https://github.com/oracle/graal/blob/master/docs/reference-manual/native-image/Reflection.md[here].
ja_jp: GraalVMでのリフレクションについての詳細は link:https://github.com/oracle/graal/blob/master/docs/reference-manual/native-image/Reflection.md[こちら]をご覧ください。

source: More information about reflection in GraalVM can be found https://www.graalvm.org/{graalvm-version}/reference-manual/native-image/dynamic-features/Reflection/[here].
ja_jp: GraalVMでのリフレクションについての詳細は https://www.graalvm.org/{graalvm-version}/reference-manual/native-image/dynamic-features/Reflection/[こちら]をご覧ください。

source: More information about the health extension can be found in xref:smallrye-health.adoc[the SmallRye Health guide].
ja_jp: ヘルスエクステンションの詳細は、xref:smallrye-health.adoc[SmallRye Health ガイド] を参照してください。

source: More information about this annotation can be found on the javadoc of
ja_jp: このアノテーションの詳細については、javadocに記載されています

source: More information about this annotation can be found on the javadoc of link:https://javadoc.io/doc/io.quarkus/quarkus-rest-client/latest/io/quarkus/rest/client/reactive/ClientFormParam.html[`@ClientFormParam`].
ja_jp: このアノテーションの詳細は link:https://javadoc.io/doc/io.quarkus/quarkus-rest-client/latest/io/quarkus/rest/client/reactive/ClientFormParam.html[@ClientFormParam] のjavadocで確認できます。

source: More information about this annotation can be found on the javadoc of link:https://javadoc.io/doc/io.quarkus/quarkus-rest-client/latest/io/quarkus/rest/client/reactive/ClientQueryParam.html[`@ClientQueryParam`].
ja_jp: このアノテーションの詳細は、link:https://javadoc.io/doc/io.quarkus/quarkus-rest-client/latest/io/quarkus/rest/client/reactive/ClientQueryParam.html[`@ClientQueryParam`] の javadoc で確認できます。

source: More information about this class and supported methods can be found on the javadoc of link:https://javadoc.io/doc/io.quarkus.resteasy.reactive/resteasy-reactive-client/latest/org/jboss/resteasy/reactive/client/api/ClientMultipartForm.html[`ClientMultipartForm`].
ja_jp: このクラスとサポートされているメソッドの詳細は、link:https://javadoc.io/doc/io.quarkus.resteasy.reactive/resteasy-reactive-client/latest/org/jboss/resteasy/reactive/client/api/ClientMultipartForm.html[`ClientMultipartForm`] の javadoc を参照してください。

source: More information about which health check procedures should be used in which situation is detailed in the MicroProfile Health specification. Generally, the liveness procedures determine whether the application should be restarted while readiness procedures determine whether it makes sense to contact the application with requests.
ja_jp: どのような状況でどのヘルスチェック手順を使用すべきかについての詳細は、MicroProfile Health 仕様に記載されています。一般的には、liveness手続きはアプリケーションを再起動すべきかどうかを判断し、readiness手続きはアプリケーションにリクエストを出すことが意味のあることかどうかを判断します。

source: More information can be found in the link:building-native-image#testing-the-native-executable[Testing the native executable Guide].
ja_jp: 詳細については、次のリンクを参照してください: link:building-native-image#testing-the-native-executable[Testing the native executable Guide].

source: More information in the https://quarkus.io/version/main/guides/cache-redis-reference[dedicated guide].
ja_jp: 詳しくは link:https://quarkus.io/version/main/guides/cache-redis-reference[専用ガイド] を参照下さい。

source: More information in the link:/guides/reactive-routes#http-compression[Reactive Routes guide] and the link:/guides/resteasy-reactive#http-compression[RESTEasy Reactive guide].
ja_jp: 詳細は、 link:/guides/reactive-routes#http-compression[Reactive Routesガイド] と link:/guides/resteasy-reactive#http-compression[RESTEasy Reactiveガイド] を参照してください。

source: More information on how to use `Emitter` can be found in https://smallrye.io/smallrye-reactive-messaging/latest/concepts/emitter/[SmallRye Reactive Messaging – Emitters and Channels]
ja_jp: `Emitter` の使用方法の詳細については、 https://smallrye.io/smallrye-reactive-messaging/latest/concepts/emitter/[SmallRye Reactive Messaging – Emitters and Channels] を参照してください。

source: More information on how to use `Emitter` can be found in https://smallrye.io/smallrye-reactive-messaging/smallrye-reactive-messaging/3.1/emitter/emitter.html#_emitter_and_channel[SmallRye Reactive Messaging – Emitters and Channels]
ja_jp: `Emitter` の使い方に関する詳細情報は、 https://smallrye.io/smallrye-reactive-messaging/smallrye-reactive-messaging/3.1/emitter/emitter.html#_emitter_and_channel[SmallRye Reactive Messaging – Emitters and Channels] を参照してください。

source: More information on the `Cache-Control` header and be found in link:https://datatracker.ietf.org/doc/html/rfc7234[RFC 7234]
ja_jp: `Cache-Control` ヘッダーの詳細は、 link:https://datatracker.ietf.org/doc/html/rfc7234[RFC 7234] を参照してください

source: More information on this topic can be found on the xref:cdi-reference.adoc#bean_discovery[Bean Discovery] section of the CDI guide.
ja_jp: このトピックの詳細については、CDIガイドの link:cdi-reference.html#bean_discovery[Bean Discovery] セクションを参照してください。

source: More migration details
ja_jp: 移行の詳細

source: More on this in the link:/guides/rest-json#multipart-support[Writing JSON REST Services guide].
ja_jp: これについての詳細は、 link:/guides/rest-json#multipart-support[JSON RESTサービスの作成ガイド] を参照してください。

source: More on this one in link:/guides/amazon-iam[the Amazon IAM guide].
ja_jp: これについては、 https://quarkus.io/guides/amazon-iam[Amazon IAM ガイド]で詳しく紹介されています。

source: More recently, OpenTelemetry Metrics has become available in the xref:opentelemetry.adoc[`quarkus-opentelemetry`] extension, but it's disabled by default because metrics semantic conventions are not stable yet.
ja_jp: 最近では、OpenTelemetry メトリクスが、xref:opentelemetry.adoc[`quarkus-opentelemetry`] エクステンションで利用可能になりましたが、メトリクスのセマンティック規則がまだ安定していないため、デフォルトでは無効になっています。

source: More specifically a `Secret` like the one below is generated:
ja_jp: 具体的には、以下のような `Secret` が生成されます。

source: More specifically a `Secret`like the one bellow is genrated:
ja_jp: 具体的には以下のような「シークレット」が生成されます:

source: More specifically on the Swagger UI front, all the Swagger UI configuration knobs have been exposed as Quarkus configuration properties. You can learn more about it in link:/blog/stylish-api/[the just published Stylish API blog post].
ja_jp: より具体的には、Swagger UI の前面では、すべての Swagger UI 設定のつまみが Quarkus の設定プロパティーとして公開されています。それについては、 https://quarkus.io/blog/stylish-api/[先日公開されたばかりの Stylish API のブログ記事]で紹介しています。

source: More specifically, the rate limit state is uniquely identified by the combination of the bean class (`java.lang.Class`) and the method object (`java.lang.reflect.Method`) representing the guarded method.
ja_jp: 具体的には、流量制御の状態は、Bean クラス (`java.lang.Class`) と、保護されたメソッドを表すメソッドオブジェクト (`java.lang.reflect.Method`) の組み合わせによって一意に識別されます。

source: More than one `HttpAuthenticationMechanism` can be combined, for example, the built-in `Basic` or `JWT` mechanism provided by `quarkus-smallrye-jwt` has to be used to verify the service clients credentials passed as the HTTP `Authorization` `Basic` or `Bearer` scheme values while the `Authorization Code` mechanism provided by `quarkus-oidc` has to be used to authenticate the users with Keycloak or other OpenID Connect providers.
ja_jp: 複数の `HttpAuthenticationMechanism` は組み合わせて使っていくことができます。例えば、HTTP `Authorization` `Basic` または `Bearer` スキーム値として渡されたサービスクライアントの資格情報を検証するためには、 `quarkus-smallrye-jwt` によって提供される `Basic` または `JWT` メカニズムを使う必要がありますし、Keycloak やその他の OpenID Connect プロバイダでユーザを認証するには `quarkus-oidc` の `Authorization Code` メカニズムを使用していく必要があります。

source: More to come and contributions are very welcome in this area.
ja_jp: 今後更に追加します。また、コントリビューションは大歓迎です。

source: More will come soon.
ja_jp: 近日中に更に追加予定です。

source: Moreover, by default the directory where the generated resources are created is `target/kubernetes`, to change it, we need to use:
ja_jp: また、デフォルトでは生成されたリソースが作成されるディレクトリは `target/kubernetes` です。これを変更するには次を使用する必要があります:

source: Moreover, the `quarkus-test-hibernate-reactive-panache` dependency provides the `io.quarkus.test.hibernate.reactive.panache.TransactionalUniAsserter` that can be injected as a method parameter of a test method annotated with `@RunOnVertxContext`. The `TransactionalUniAsserter` is a `io.quarkus.test.vertx.UniAsserterInterceptor` that wraps each assert method within a separate reactive transaction.
ja_jp: さらに、 `quarkus-test-hibernate-reactive-panache` 依存関係は、 `@RunOnVertxContext` でアノテーションが付けられたテストメソッドのメソッドパラメーターとして注入できる `io.quarkus.test.hibernate.reactive.panache.TransactionalUniAsserter` を提供します。 `TransactionalUniAsserter` は、各アサートメソッドを個別のリアクティブトランザクション内にラップする `io.quarkus.test.vertx.UniAsserterInterceptor` です。

source: Moreover, the default annotations have been added.
ja_jp: さらに、デフォルトのアノテーションが追加されました。

source: Moreover, you can configure a REST client to use your custom hostname verify strategy. All you need to do is to provide a class that implements the interface `javax.net.ssl.HostnameVerifier` and add the following property to your configuration:
ja_jp: さらに、カスタムのホスト名検証ストラテジーを使用するようにRESTクライアントを設定することができます。必要なのは、インターフェース `javax.net.ssl.HostnameVerifier` を実装したクラスを用意し、以下のプロパティを設定に追加することだけです。

source: Moreover, you can have more control over the RBAC resources to be generated:
ja_jp: さらに、生成されるRBACリソースをよりコントロールすることができます:

source: Moreover, you can provide the arguments that will be used by the Kubernetes job via the property `quarkus.kubernetes.arguments`. For example, after adding the property `quarkus.kubernetes.arguments=A,B` and building your project, the following Job resource will be generated:
ja_jp: さらに、Kubernetes Jobが使用する引数を、プロパティ `quarkus.kubernetes.arguments` を介して提供することができます。例えば、 `quarkus.kubernetes.arguments=A,B` というプロパティを追加し、プロジェクトをビルドすると、以下のようなJobリソースが生成されます。

source: Most IDEs offer the possibility to run a selected class as a JUnit test directly. For this you should set a few properties in the settings of your chosen IDE:
ja_jp: ほとんどの IDE では、選択したクラスを JUnit テストとして直接実行できるようになっています。そのためには、選択した IDE の設定でいくつかのプロパティーを設定する必要があります:

source: Most OAuth2 providers fail if they see an `openid` scope but this scope is expected by default by most OIDC providers. This is when `quarkus.oidc.authentication.add-openid-scope=false` may have to be set.
ja_jp: ほとんどの OAuth2 プロバイダーは `openid` スコープを認識すると失敗しますが、このスコープはほとんどの OIDC プロバイダーでデフォルトで想定されています。このような場合に、 `quarkus.oidc.authentication.add-openid-scope=false` を設定する必要があるかもしれません。

source: Most OIDC and OAuth2 providers with the exception of <<strava>> will enforce that the authorization code flow can be completed only if the redirect URI matches precisely the redirect URI configured in a given provider's dashboard.
ja_jp: ほとんどの OIDC および OAuth2 プロバイダー (<<strava>> 以外) は、リダイレクト URI が特定のプロバイダーのダッシュボードで設定されたリダイレクト URI と正確に一致する場合に限り、認可コードフローを完了できるようにします。

source: Most OIDC providers expect a `scope=openid` parameter in the initial redirect URL, and Quarkus always adds it itself by default, there is no need to do `quarkus.oidc.authentication.scopes=openid`, but quite often you may have to provide an additional scope or a comma separated list of scopes to request additional permissions for the access token that will be issued (alongside ID and refresh tokens) once the authorization code flow is completed. For example, if you need Quarkus application to read your Google Calendar on your behalf, you can do `quarkus.oidc.authentication.scopes=https://www.googleapis.com/auth/calendar.readonly`.
ja_jp: ほとんどの OIDC プロバイダーは、初期リダイレクト URL に `scope=openid` パラメーターが含まれることを想定しており、Quarkus はデフォルトで常にこれを自動追加するため、 `quarkus.oidc.authentication.scopes=openid` と設定する必要はありません。しかし、認可コードフローの完了後に (ID およびリフレッシュトークンとともに) 発行されるアクセストークンに対して追加の権限をリクエストするために、追加のスコープまたはカンマ区切りのスコープリストを提供しなければならないことがよくあります。たとえば、Quarkus アプリケーションがユーザーに代わって Google カレンダーを読み取る必要がある場合は、 `quarkus.oidc.authentication.scopes=https://www.googleapis.com/auth/calendar.readonly` と設定できます。

source: Most Quarkus Messaging extensions provide a Dev Service to simplify the development and testing of applications. The Dev Service creates a broker instance configured to work out-of-the-box with the Quarkus Messaging extension.
ja_jp: ほとんどの Quarkus Messaging エクステンションは、アプリケーションの開発とテストを簡素化する Dev Service を提供します。 Dev Service は、Quarkus Messaging エクステンションですぐに使用できるように設定されたブローカーインスタンスを作成します。

source: Most Quarkus clients do this automatically, invoking the continuation in the proper context.
ja_jp: ほとんどのQuarkusクライアントは自動的にこれを行い、適切なコンテキストで継続を呼び出します。

source: Most Quarkus tags get reported in the US link:https://nvd.nist.gov[National Vulnerability Database (NVD)]. For information about security vulnerabilities, see the xref:security-vulnerability-detection.adoc[Security vulnerability detection and reporting in Quarkus] guide.
ja_jp: ほとんどのQuarkusタグは、米国 link:https://nvd.nist.gov[国家脆弱性データベース（NVD] ）に報告されます。 セキュリティ脆弱性については、 xref:security-vulnerability-detection.adoc[Quarkusのセキュリティ脆弱性の検出と報告] に関するガイドを参照してください。

source: Most changes are pushed upstream to help the underlying library run on GraalVM
ja_jp: ほとんどの変更は、基礎となるライブラリが GraalVM 上で動作するように upstream にプッシュされます。

source: Most extensions use Jandex as a source of truth to find out what to do. Those extensions won't see new/modified endpoints in the bytecode itself. The solution to this limitation is annotation transformers. You should also be aware that while Arc and Quarkus REST honour annotation transformers, not all extensions do.
ja_jp: ほとんどのエクステンションは、Jandex を信頼できる情報源として使用し、何をすべきかを判断します。これらのエクステンションは、バイトコード内の新規または変更されたエンドポイントを認識できません。 この制限は、アノテーショントランスフォーマーで解決できます。ただし、Arc や Quarkus REST はアノテーショントランスフォーマーを適用しますが、すべてのエクステンションが対応しているわけではないことにも注意が必要です。

source: Most likely you need to share the LRA coordinator between applications. The Dev Services for LRA coordinator implements a _service discovery_ mechanism for your multiple Quarkus applications running in _dev_ mode to share a single coordinator.
ja_jp: ほとんどの場合、アプリケーション間で LRA コーディネーターを共有する必要があります。LRA コーディネーター 用 Dev Services は、_開発モード_ で動作する複数の Quarkus アプリケーションが単一のコーディネーターを共有するための _サービスディスカバリー_ メカニズムを実装しています。

source: Most notably, it is now possible to indicate which Hibernate ORM dialect should be used by default even for external JDBC driver extensions.
ja_jp: 最も注目すべきは、外部JDBCドライバエクステンションの場合でも、デフォルトで使用するHibernate ORM dialect を指定できるようになったことです。
